#+TITLE: High Performance Computing
#+AUTHOR: Emil VATAI
*** Bignum [code]
     #+BEGIN_SRC python :results output
       reg = 0
       for bit_idx in range(200):
           bit = 2 ** bit_idx
           reg += bit
           # print(f"{reg: >32b}") ### do both!!!
       print(f"reg: {reg}")
       print(f"reg+1: {reg + 1}")
     #+END_SRC

     #+RESULTS:
     : reg: 1606938044258990275541962092341162602522202993782792835301375
     : reg+1: 1606938044258990275541962092341162602522202993782792835301376

     #+BEGIN_SRC C :results output
       const int sizeof_int_bits = sizeof(int) * 8;
       printf("sizeof int in bits: %d\n", sizeof_int_bits);
       int reg = 0;
       for (int i = 0; i < sizeof_int_bits; i++) {
         int bit = 1 << i; // 2 ** i
         reg += bit;
         printf("%8x\n", reg);
       }
       printf("result: %u\n", reg);
       printf("result + 1: %u\n", reg + 1);
     #+END_SRC

     #+RESULTS:
     #+begin_example
     sizeof int in bits: 32
            1
            3
            7
            f
           1f
           3f
           7f
           ff
          1ff
          3ff
          7ff
          fff
         1fff
         3fff
         7fff
         ffff
        1ffff
        3ffff
        7ffff
        fffff
       1fffff
       3fffff
       7fffff
       ffffff
      1ffffff
      3ffffff
      7ffffff
      fffffff
     1fffffff
     3fffffff
     7fffffff
     ffffffff
     result: 4294967295
     result + 1: 0
     #+end_example

** What do HPC people program?
   - Lots of things, mostly scientific software
   - BLAS: Basic Linear Algebra Subroutines (FORTRAN!)
   - LAPACK: Linear Algebra PACkage
   - LINPACK Benchmarks: http://top500.org
     #+BEGIN_SRC python :results output
       import numpy as np
       np.show_config()
     #+END_SRC

     #+RESULTS:
     #+begin_example
     blas_mkl_info:
       NOT AVAILABLE
     blis_info:
       NOT AVAILABLE
     openblas_info:
       NOT AVAILABLE
     atlas_3_10_blas_threads_info:
       NOT AVAILABLE
     atlas_3_10_blas_info:
       NOT AVAILABLE
     atlas_blas_threads_info:
       NOT AVAILABLE
     atlas_blas_info:
       NOT AVAILABLE
     accelerate_info:
       NOT AVAILABLE
     blas_info:
         libraries = ['cblas', 'blas', 'blas']
         library_dirs = ['/usr/lib64']
         include_dirs = ['/usr/local/include', '/usr/include']
         language = c
         define_macros = [('HAVE_CBLAS', None)]
     blas_opt_info:
         define_macros = [('NO_ATLAS_INFO', 1), ('HAVE_CBLAS', None)]
         libraries = ['cblas', 'blas', 'blas']
         library_dirs = ['/usr/lib64']
         include_dirs = ['/usr/local/include', '/usr/include']
         language = c
     lapack_mkl_info:
       NOT AVAILABLE
     openblas_lapack_info:
       NOT AVAILABLE
     openblas_clapack_info:
       NOT AVAILABLE
     flame_info:
       NOT AVAILABLE
     atlas_3_10_threads_info:
       NOT AVAILABLE
     atlas_3_10_info:
       NOT AVAILABLE
     atlas_threads_info:
       NOT AVAILABLE
     atlas_info:
       NOT AVAILABLE
     lapack_info:
         libraries = ['lapack', 'lapack']
         library_dirs = ['/usr/lib64']
         language = f77
     lapack_opt_info:
         libraries = ['lapack', 'lapack', 'cblas', 'blas', 'blas']
         library_dirs = ['/usr/lib64']
         language = c
         define_macros = [('NO_ATLAS_INFO', 1), ('HAVE_CBLAS', None)]
         include_dirs = ['/usr/local/include', '/usr/include']
     #+end_example

**** AVX extensions (in asm)
     #+BEGIN_SRC asm :tangle avx_prn.s
       # C-c C-v t
       # RDI, RSI, RDX, RCX, R8, R9
       # XMM0-XMM7, stack
       .extern printf
       .section .data
       hello:  .asciz "xmm: %lf %lf %lf %lf (extra: %lf)\n"
       data:   .double 1.0, 2.0, 3.0, 4.0
       .section .text
       .globl main
       main:
               push %rbp

               vmovupd data(%rip), %ymm0
               vmulpd %ymm0, %ymm0, %ymm0
               vmovupd %ymm0, data(%rip)

               // vhaddpd %ymm0, %ymm0, %ymm1
               // vphaddd %ymm1, %ymm1, %ymm1
               // vextractf128 $0, %ymm1, %xmm4
               // vextractf128 $1, %ymm1, %xmm5
               // addsd %xmm5, %xmm4

               // Call printf
               lea hello(%rip), %rdi
               movq 8*0+data(%rip), %xmm0
               movq 8*1+data(%rip), %xmm1
               movq 8*2+data(%rip), %xmm2
               movq 8*3+data(%rip), %xmm3
               mov $5, %rax
               call printf

               pop  %rbp
               mov $0, %rax
               ret
     #+END_SRC

     #+BEGIN_SRC shell
       make -B avx_prn && ./avx_prn
     #+END_SRC

     #+RESULTS:
     : cc    avx_prn.s   -o avx_prn

*** Programming languages
    - Interpreted vs compiled
    - Dynamic vs static, weakly vs strongly typed
    - Python, C++, RUST!!!
    - Vector bool
      #+BEGIN_SRC C++ :includes <vector>, <iostream>, <algorithm>
        std::vector<int> vec = {1,3,2};
        std::sort(begin(vec), end(vec));
        for (size_t i = 0; i < vec.size(); i++)
            std::cout << vec[i] << std::endl;
      #+END_SRC

      #+RESULTS:
      | 1 |
      | 2 |
      | 3 |

***** An example
         #+BEGIN_SRC C++ :flags -fopenmp
           #include <iostream>
           #include <chrono>
           using namespace std::chrono;
           int main() {
             size_t n = 100000000;
             double *array = new double[n];
             auto start = high_resolution_clock::now();
             #pragma omp parallel for
             for (int i = 0; i < n; i++) {
               double k = i + 1;
               array[i] += 1 / (k*k);
             }
             auto stop = high_resolution_clock::now();
             double sum = 0.0;
             for (int i = 0; i < n; i++)
               sum += array[i];
             auto duration = duration_cast<microseconds>(stop - start);
             std::cout << "sum1/x^2 " << sum << std::endl;
             std::cout << "pi " << 6 * sum / 3.14 << std::endl;
             std::cout << "duration " << duration.count() << "ms" << std::endl;
           }
         #+END_SRC

         #+RESULTS:
         | sum1/x^2 |  1.64493 |
         | pi       |  3.14319 |
         | duration | 495476ms |

